# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "issenn/cask-fonts"

# Binaries
brew "openssl@1.1"
brew "curl", link: false
brew "curl-openssl", link: false
brew "git"
brew "zsh"
brew "coreutils"  # Those that come with macOS are outdated
brew "grep"
brew "make"
brew "cmake"
brew "gcc"
brew "gawk"
brew "gnu-sed"
brew "tree"  # List directories in a tree structure
brew "stow"
brew "lua"
brew "tmux"
# brew "exa"
# brew "fzf"
brew "neofetch"
brew "screenfetch"
brew "lolcat"
brew "timewarrior"


# Fonts
cask "issenn/cask-fonts/font-meslo-nerd-font-patched"

# Apps
cask_args appdir: "/Applications"

cask "shadowsocksx-ng-r"
cask "iterm2"

# Do it
# brew bundle
